%%获取判断矩阵
disp('请输入判断矩阵A')
A = input('A = ')
[n, n] = size(A); % 获取矩阵的维数

%%一致性检验
[V, D] = eig(A); % 计算特征值和特征向量
Max_eig = max(max(D)); % 获取最大特征值
CI = (Max_eig - n) / (n - 1); % 计算一致性比例
RI = [0 0.0001 0.52 0.89 1.12 1.26 1.36 1.41 1.46 1.49 1.52 1.54 1.56 1.58 1.59]; % 随机一致性指标
CR = CI / RI(n); % 计算一致性比例CR
disp('最大特征值为:');
disp(Max_eig);
disp('一致性指标CI = '); disp(CI);
disp('一致性比例CR = '); disp(CR);
if CR < 0.10
    disp('CR < 0.10，该判断矩阵A的一致性可以接受!');
else
    disp('注意：CR >= 0.10，该判断矩阵需要进行修改!');
end

%% 方法1： 算术平均法求权重
Sum_A = sum(A); % 将A矩阵按列求和
SUM_A = repmat(Sum_A, n, 1); % 重复行向量以匹配矩阵维度
Stand_A = A ./ SUM_A; % 标准化矩阵
disp('算术平均法求权重的结果为：');
w1 = sum(Stand_A, 2) ./ n; % 计算权重
disp(w1);

%% 方法2： 特征值法求权重
disp('特征值法求权重的结果为：');
w2 = V(:, 1) / sum(V(:, 1)); % 计算权重
disp(w2);

disp('两种方法的平均权值为：');
disp((w1 + w2) / 2); % 输出两种方法的平均权重
